//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
//
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	AmiPpmPolicy.uni
//
// Description:	PpmPolicy unicode description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//
// CPU Configuration
//
#string STR_PPM_FORM                    #language eng "PPM Configuration"

#string STR_PPM_FORM_HELP               #language eng "PPM Configuration Parameters"

#string STR_PPM_EIST_PROMPT		#language eng "EIST"
#string STR_PPM_EIST_PROMPT_HELP	#language eng "Enable/Disable Intel SpeedStep"

#string STR_PPM_CSTATE_PROMPT           #language eng "CPU C state Report"
#string STR_PPM_CSTATE_PROMPT_HELP      #language eng "Enable/Disable CPU C state report to OS"

#string STR_PPM_ENCSTATE_PROMPT       #language eng "   Enhanced C state"
#string STR_PPM_ENCSTATE_PROMPT_HELP  #language eng "Enable/Disable Enhanced CPU C state"

#string STR_PPM_HARDC4E_PROMPT       #language eng "   CPU Hard C4E"
#string STR_PPM_HARDC4E_PROMPT_HELP  #language eng "Enable/Disable CPU Hard C4E funciton"

#string STR_PPM_C4_PROMPT       #language eng "   CPU C4 state"
#string STR_PPM_C4_PROMPT_HELP  #language eng "Enable/Disable CPU C4 state"

#string STR_PPM_C6_PROMPT       #language eng "   CPU C6 state"
#string STR_PPM_C6_PROMPT_HELP  #language eng "Enable/Disable CPU C6 state"

#string STR_PPM_C7_PROMPT       #language eng "   CPU C7 state"
#string STR_PPM_C7_PROMPT_HELP  #language eng "Enable/Disable CPU C7 state"


#string STR_PPM_MAXCX_PROMPT   #language eng "Max CPU C-state"
#string STR_PPM_MAXCX_PROMPT_HELP  #language eng "This option controls Max C state that the processor will support"

#string STR_PPM_ENABLED        #language eng "Enabled"
#string STR_PPM_DISABLED       #language eng "Disabled"

#string STR_PPM_C1             #language eng " C1"
#string STR_PPM_C6             #language eng " C6"
#string STR_PPM_C7             #language eng " C7"

#string STR_PPM_S0IX_PROMPT   	       #language eng "S0ix"
#string STR_PPM_S0IX_PROMPT_HELP       #language eng "Enable/Disable CPU S0ix state"

//#string <string name> #language eng ""

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1987-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
